src/UKHO.ADDS.Mocks/Configuration/Files/sap/response.xml

<?xml version=\"1.0\" encoding=\"utf-8\"?>
<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns=\"urn:sap-com:document:sap:rfc:functions\">
      <IM_MATINFO xmlns=\"\">
        <CORRID>b31218f0-d625-49fc-ad93-f576941a49a6</CORRID>
        <NOOFACTIONS>4</NOOFACTIONS>
        <RECDATE>20250320</RECDATE>
        <RECTIME>114008</RECTIME>
        <ORG>UKHO</ORG>
        <ACTIONITEMS>
          <item>
            <ACTIONNUMBER>1</ACTIONNUMBER>
            <ACTION>CREATE ENC CELL</ACTION>
            <PRODUCT>ENC CELL</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB104203</CHILDCELL>
            <PRODUCTNAME>GB104203</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Auto Test Product</TITLE>
            <EDITIONNO>1</EDITIONNO>
            <UPDATENO>0</UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202436</WEEKNO>
            <VALIDFROM>20240905</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY>3D312AC6D2</ACTIVEKEY>
            <NEXTKEY>2D69141367</NEXTKEY>
          </item>
          <item>
            <ACTIONNUMBER>2</ACTIONNUMBER>
            <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL></CHILDCELL>
            <PRODUCTNAME>GB104203</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY>GB</AGENCY>
            <PROVIDER>1</PROVIDER>
            <ENCSIZE>large</ENCSIZE>
            <TITLE>Auto Test Product</TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE>AVCS Units Overview</UNITTYPE>
            <WEEKNO>202436</WEEKNO>
            <VALIDFROM>20240905</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </item>
          <item>
            <ACTIONNUMBER>3</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB104203</CHILDCELL>
            <PRODUCTNAME>GB104203</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202436</WEEKNO>
            <VALIDFROM>20240905</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </item>
          <item>
            <ACTIONNUMBER>4</ACTIONNUMBER>
            <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
            <PRODUCT>AVCS UNIT</PRODUCT>
            <PRODTYPE>S57</PRODTYPE>
            <CHILDCELL>GB104203</CHILDCELL>
            <PRODUCTNAME>PAYSF</PRODUCTNAME>
            <CANCELLED></CANCELLED>
            <REPLACEDBY></REPLACEDBY>
            <AGENCY></AGENCY>
            <PROVIDER></PROVIDER>
            <ENCSIZE></ENCSIZE>
            <TITLE></TITLE>
            <EDITIONNO></EDITIONNO>
            <UPDATENO></UPDATENO>
            <UNITTYPE></UNITTYPE>
            <WEEKNO>202436</WEEKNO>
            <VALIDFROM>20240905</VALIDFROM>
            <CORRECTION>N</CORRECTION>
            <ACTIVEKEY></ACTIVEKEY>
            <NEXTKEY></NEXTKEY>
          </item>
        </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>
